Repository: ErrrOrrr503/djando-edu
Catalog: django_edu/locale/*/LC_MESSAGES/django.po
Languages: ru

source: <p><strong>Passed!</strong></p>
ru: <p><strong>Верно!</strong></p>

source: <p><strong>Failed!</strong></p>
ru: <p><strong>Не верно!</strong></p>

source: <p>{passed} tests out of {total} passed.</p>
ru: <p>{passed} тестов из {total} прошли.</p>

source: <div class="container d-flex"><div>Test {n}: </div><div class="text-ok">OK</div></div>
ru: <div class="container d-flex"><div>Тест {n}: </div><div class="text-ok">OK</div></div>

source: <div class="container d-flex"><div>Test {n}: </div><div class="text-fail">FAIL</div></div>
ru: <div class="container d-flex"><div>Тест {n}: </div><div class="text-fail">ОШИБКА</div></div>

source: <table class="table table-sm table-bordered-black"><thead class="table-bordered-black"><tr class="table-bordered-black"><th class="table-bordered-black" scope="col">Received</th><th class="table-bordered-black" scope="col">Expected</th></tr></thead><tbody class="table-bordered-black"><tr class="table-bordered-black"><td class="table-bordered-black"><span class="test-io-full multiline-text">{received}</span></td><td class="table-bordered-black"><span class="test-io-full multiline-text">{expected}</span></td></tr></tbody></table>
ru: <table class="table table-sm table-bordered-black"><thead class="table-bordered-black"><tr class="table-bordered-black"><th class="table-bordered-black" scope="col">Полученный вывод</th><th class="table-bordered-black" scope="col">Ожидаемый вывод</th></tr></thead><tbody class="table-bordered-black"><tr class="table-bordered-black"><td class="table-bordered-black"><span class="test-io-full multiline-text">{received}</span></td><td class="table-bordered-black"><span class="test-io-full multiline-text">{expected}</span></td></tr></tbody></table>

source: Answer for a task must not be empty
ru: Тескт ответа не должен быть пустым

source: Timed out...
ru: Превышено время...

source: Too long name for a contest
ru: Слишком длинное название контеста

source: Contest name must not be empty
ru: Название контеста не должно быть пустым

source: Contest name must not contain html
ru: Название контеста не должно содержать html

source: Contest name must be unique
ru: Название контеста должно быть уникальным

source: Too long reference answer for a task
ru: Слишком длинный ответ для задачи

source: Task reference answer must not be empty
ru: Ответ для задачи не должен быть пустым

source: Too long name for a task
ru: Слишком длинное название задачи

source: Task name must not be empty
ru: Название задачи не должно быть пустым

source: Task name must not contain html
ru: Название задачи не должно содержать html

source: Too long text for a task
ru: Слишком длинное условие задачи

source: Task text must not be empty
ru: Условие задачи не должно быть пустым

source: Task text must not contain script
ru: Условие задачи не должно содерждать script

source: HTML error: {err}
ru: Ошибка HTML: {err}

source: Test output must not be empty
ru: Тестовый вывод не должен быть пустым

source: <h1>Contest not found</h1>
ru: <h1>Контест не найден</h1>

source: <h1>Task not found</h1>
ru: <h1>Задача не найдена</h1>
